#+title: CL-projects
:PROPERTIES:
:ID:       245c4e3d-7721-4a84-90bf-2a89c4d111cf
:END:
The =cl-project= system can give us the hability to create project
templates.

** Installing through =quick-lisp=
#+begin_src lisp :results output
(ql:quickload :cl-project)
#+end_src

#+RESULTS:
#+begin_example
To load "cl-project":
  Load 3 ASDF systems:
    alexandria asdf uiop
  Install 10 Quicklisp releases:
    anaphora cl-ansi-text cl-colors cl-colors2 cl-emb
    cl-ppcre cl-project let-plus local-time prove
==================================================
6,304 bytes in 0.00 seconds (0.00KB/sec)
==================================================
11,247 bytes in 0.00 seconds (0.00KB/sec)
==================================================
14,566 bytes in 0.00 seconds (0.00KB/sec)
==================================================
25,522 bytes in 0.00 seconds (7475.65KB/sec)
==================================================
6,787 bytes in 0.00 seconds (0.00KB/sec)
==================================================
877,452 bytes in 0.24 seconds (3570.36KB/sec)
==================================================
779,489 bytes in 0.22 seconds (3408.45KB/sec)
==================================================
155,009 bytes in 0.11 seconds (1376.16KB/sec)
==================================================
14,557 bytes in 0.00 seconds (0.00KB/sec)
==================================================
5,355 bytes in 0.00 seconds (1569.00KB/sec)
; Loading "cl-project"
[package cl-ppcre]................................
..................................................
[package cl-emb]..................................
[package cl-emb-intern]...........................
[package local-time]..............................
[package cl-colors2]..............................
[package cl-colors2.svg]..........................
[package cl-colors2.svg-extended].................
..................................................
[package cl-ansi-text]............................
[package anaphora]................................
[package anaphora-basic]..........................
[package anaphora-symbol].........................
[package let-plus]................................
[package cl-colors]...............................
[package prove.output]............................
[package prove.report]............................
[package prove.reporter]..........................
[package prove.color].............................
[package prove.asdf]..............................
[package prove.suite].............................
[package prove.test]..............................
[package prove]...................................
[package prove.reporter.tap]......................
[package prove.reporter.fiveam]...................
[package prove.reporter.list].....................
[package prove.reporter.dot]......................
[package cl-project.specials].....................
[package cl-project.io]...........................
[package cl-project.file].........................
[package cl-project.middleware]...................
[package cl-project.skeleton].....................
[package cl-project]
#+end_example

** How to make a project
#+begin_src lisp :results output :eval no
(cl-project:make-project #p"path/to/demo-project")
#+end_src
